export const questions = {
  "allah_names": [

   {
      "question": "اللہ کا کون سا نام \"سب سے بڑا رحمت کرنے والا\" ہے؟",
      "options": ["الرحمن", "الغفور", "العلیم", "الجبار"],
      "answer": "الرحمن"
    },
    {
      "question": "اللہ کا کون سا نام \"سب کچھ جاننے والا\" ہے؟",
      "options": ["الخالق", "العلیم", "القدوس", "الرزاق"],
      "answer": "العلیم"
    },
    {
      "question": "اللہ کا کون سا نام \"ہر چیز کو پیدا کرنے والا\" ہے؟",
      "options": ["الخالق", "الحفیظ", "الغفور", "القوی"],
      "answer": "الخالق"
    },
    {
      "question": "اللہ کا کون سا نام \"سب سے زیادہ بخشنے والا\" ہے؟",
      "options": ["الحفیظ", "الرزاق","الغفور" , "الجبار"],
      "answer": "الغفور"
    },
    {
      "question": "اللہ کا کون سا نام \"ہر چیز کو سننے والا\" ہے؟",
      "options": ["السمیع", "البصیر", "العلیم", "القیوم"],
      "answer": "السمیع"
    },
    {
      "question": "اللہ کا کون سا نام \"ہر چیز کو دیکھنے والا\" ہے؟",
      "options": ["العلیم", "البصیر", "الغفور", "الرزاق"],
      "answer": "البصیر"
    },
    {
      "question": "اللہ کا کون سا نام \"طاقتور اور جابر\" ہے؟",
      "options": ["العلیم", "الغفور", "الجبار" , "الرزاق"],
      "answer": "الجبار"
    },
    {
      "question": "اللہ کا کون سا نام \"حافظ\" یا \"محفوظ رکھنے والا\" ہے؟",
      "options": ["الحفیظ", "الخالق", "الغفور", "الجبار"],
      "answer": "الحفیظ"
    },
    {
      "question": "اللہ کا کون سا نام \"رزق دینے والا\" ہے؟",
      "options": ["الجبار", "العلیم", "الحفیظ","الرزاق" ],
      "answer": "الرزاق"
    },
    {
      "question": "اللہ کا کون سا نام \"سب سے مقدس\" ہے؟",
      "options": ["القدوس", "الغفور", "الجبار", "السمیع"],
      "answer": "القدوس"
    },
    {
      "question": "اللہ کا کون سا نام \"رحیم\" ہے؟",
      "options": ["الرحمن", "الرحیم", "الغفور", "العلیم"],
      "answer": "الرحیم"
    },
    {
      "question": "اللہ کا کون سا نام \"سب کچھ جاننے والا اور سب کچھ دیکھنے والا\" ہے؟",
      "options": ["العلیم", "البصیر", "الجبار", "القیوم"],
      "answer": "العلیم"
    },
    {
      "question": "اللہ کا کون سا نام \"زندہ اور قائم رہنے والا\" ہے؟",
      "options": ["الرحمن","القیوم" , "الجبار", "الغفور"],
      "answer": "القیوم"
    },
    {
      "question": "اللہ کا کون سا نام \"دوسروں کو معاف کرنے والا\" ہے؟",
      "options": ["الحفیظ", "الجبار","الغفور" , "القدوس"],
      "answer": "الغفور"
    },
    {
      "question": "اللہ کا کون سا نام \"کسی کی ضرورت سے بے نیاز\" ہے؟",
      "options": ["القوی","الغنی" , "الجبار", "الحفیظ"],
      "answer": "الغنی"
    },
    {
      "question": "اللہ کا کون سا نام \"تمام مخلوقات کا مالک\" ہے؟",
      "options": ["الغفور", "القوی", "الرحیم","الملک" ],
      "answer": "الملک"
    },
    {
      "question": "اللہ کا کون سا نام \"بڑا مہربان\" ہے؟",
      "options": ["الرحمن", "الرحیم", "الغفور", "القدوس"],
      "answer": "الرحمن"
    },
    {
      "question": "اللہ کا کون سا نام \"انتہائی بخشنے والا\" ہے؟",
      "options": ["الغفور", "العلیم", "القیوم", "الجبار"],
      "answer": "الغفور"
    },
    {
      "question": "اللہ کا کون سا نام \"کامل حکمت والا\" ہے؟",
      "options": ["الحکیم", "العلیم", "القدوس", "الجبار"],
      "answer": "الحکیم"
    },
    {
      "question": "اللہ کا کون سا نام \"سب کچھ کرنے والا\" ہے؟",
      "options": ["القدیر", "الحفیظ", "الغفور", "الرحیم"],
      "answer": "القدیر"
    },
    {
      "question": "اللہ کا کون سا نام \"اعلیٰ ترین اور بلند\" ہے؟",
      "options": [ "القیوم","العلی", "الجبار", "الحفیظ"],
      "answer": "العلی"
    },
    {
      "question": "اللہ کا کون سا نام \"بڑا عظیم\" ہے؟",
      "options": ["العظیم", "الجبار", "القدوس", "القدیر"],
      "answer": "العظیم"
    },
    {
      "question": "اللہ کا کون سا نام \"سب سے طاقتور\" ہے؟",
      "options": ["الحفیظ", "الجبار", "القوی" , "الغفور"],
      "answer": "القوی"
    },
    {
      "question": "اللہ کا کون سا نام \"سب کچھ سننے والا\" ہے؟",
      "options": ["السمیع", "البصیر", "العلیم", "الحفیظ"],
      "answer": "السمیع"
    },
    {
      "question": "اللہ کا کون سا نام \"ہر چیز کو دیکھنے والا\" ہے؟",
      "options": ["القیوم", "السمیع", "العلیم", "البصیر" ],
      "answer": "البصیر"
    },
    {
      "question": "اللہ کا کون سا نام \"سب سے معزز\" ہے؟",
      "options": ["المکرم", "الجبار", "القدوس", "الغفور"],
      "answer": "المکرم"
    },
    {
      "question": "اللہ کا کون سا نام \"مظلوموں کا مددگار\" ہے؟",
      "options": ["الجبار","القدوس" ,"الناصر" , "الغفور"],
      "answer": "الناصر"
    },
    {
      "question": "اللہ کا کون سا نام \"سب سے بڑا حکمران\" ہے؟",
      "options": ["الملک", "الجبار", "القدوس", "الحفیظ"],
      "answer": "الملک"
    },
    {
      "question": "اللہ کا کون سا نام \"تمام چیزوں کا پروردگار\" ہے؟",
      "options": ["الخالق","الرزاق" , "الحفیظ", "الجبار"],
      "answer": "الرزاق"
    },
    {
      "question": "اللہ کا کون سا نام \"غفور\" ہے؟",
      "options": ["بخشنے والا", "پیدا کرنے والا", "دیکھنے والا", "سننے والا"],
      "answer": "بخشنے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"الحکیم\" ہے؟",
      "options": ["معاف کرنے والا", "جبار",  "محافظ اور مددگار","حکمت والا" ],
      "answer": "حکمت والا"
    },
    {
      "question": "اللہ کا کون سا نام \"الولی\" ہے؟",
      "options": ["معاف کرنے والا", "سننے والا", "دیکھنے والا", "محافظ اور مددگار" ],
      "answer": "محافظ اور مددگار"
    },
    {
      "question": "اللہ کا کون سا نام \"العفو\" ہے؟",
      "options": ["امن والا","معاف کرنے والا" , "دیکھنے والا", "پیدا کرنے والا"],
      "answer": "معاف کرنے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"السلام\" ہے؟",
      "options": [ "صورت دینے والا", "حکمت والا", "دیکھنے والا","امن والا" ],
      "answer": "امن والا"
    },
    {
      "question": "اللہ کا کون سا نام \"المصور\" ہے؟",
      "options": [ "سننے والا","صورت دینے والا", "حکمت والا", "بخشنے والا"],
      "answer": "صورت دینے والا"
    },
     {
      "question": "اللہ کا کون سا نام \"ہر چیز پر قادر\" ہے؟",
      "options": ["القدیر", "العلیم", "الغفور", "الرحمن"],
      "answer": "القدیر"
    },
    {
      "question": "اللہ کا کون سا نام \"القاهر\" ہے؟",
      "options": ["غالب اور غالب آنے والا", "سننے والا", "بخشنے والا", "حکمت والا"],
      "answer": "غالب اور غالب آنے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"المنان\" ہے؟",
      "options": ["حکمت والا", "سننے والا","بیشمار انعام دینے والا" , "دیکھنے والا"],
      "answer": "بیشمار انعام دینے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"الهادی\" ہے؟",
      "options": ["بخشنے والا", "سننے والا", "دیکھنے والا","ہدایت دینے والا" ],
      "answer": "ہدایت دینے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"الکریم\" ہے؟",
      "options": ["سننے والا","سب سے زیادہ کرم کرنے والا" , "دیکھنے والا", "حکمت والا"],
      "answer": "سب سے زیادہ کرم کرنے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"الرؤوف\" ہے؟",
      "options": ["دیکھنے والا", "سننے والا","نرمی کرنے والا" , "بخشنے والا"],
      "answer": "نرمی کرنے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"الغفار\" ہے؟",
      "options": ["بار بار معاف کرنے والا", "سننے والا", "دیکھنے والا", "حکمت والا"],
      "answer": "بار بار معاف کرنے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"الحلیم\" ہے؟",
      "options": ["دیکھنے والا", "سننے والا","بردبار اور تحمل کرنے والا", "بخشنے والا"],
      "answer": "بردبار اور تحمل کرنے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"المجيد\" ہے؟",
      "options": ["بخشنے والا", "سننے والا", "دیکھنے والا","عظمت والا" ],
      "answer": "عظمت والا"
    },
    {
      "question": "اللہ کا کون سا نام \"المعز\" ہے؟",
      "options": ["دیکھنے والا", "سننے والا","عزت دینے والا" , "بخشنے والا"],
      "answer": "عزت دینے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"المذل\" ہے؟",
      "options": ["سننے والا","ذلت دینے والا" , "دیکھنے والا", "بخشنے والا"],
      "answer": "ذلت دینے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"الصبور\" ہے؟",
      "options": ["صبر کرنے والا", "سننے والا", "دیکھنے والا", "بخشنے والا"],
      "answer": "صبر کرنے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"الرحمان\" ہے؟",
      "options": ["دیکھنے والا", "سننے والا","سب پر مہربان", "بخشنے والا"],
      "answer": "سب پر مہربان"
    },
    {
      "question": "اللہ کا کون سا نام \"الرحیم\" ہے؟",
      "options": ["بخشنے والا", "سننے والا", "دیکھنے والا","خاص طور پر مومنوں پر رحم کرنے والا" ],
      "answer": "خاص طور پر مومنوں پر رحم کرنے والا"
    },
    {
      "question": "اللہ کا کون سا نام \"الغني\" ہے؟",
      "options": [ "سننے والا","بے نیاز", "دیکھنے والا", "بخشنے والا"],
      "answer": "بے نیاز"
    }
    ],
  "prophet_muhammad_life": [
  {
    "question": "حضرت محمد ﷺ کی پیدائش کس شہر میں ہوئی؟",
    "options": ["مدینہ", "طائف", "مکہ", "یثرب"],
    "answer": "مکہ"
  },
  {
    "question": "آپ ﷺ کی تاریخ پیدائش کیا ہے؟",
    "options": ["10 ربیع الاول", "17 ربیع الاول", "1 محرم", "27 رجب"],
    "answer": "17 ربیع الاول"
  },
  {
    "question": "حضرت محمد ﷺ کے والد کا نام کیا تھا؟",
    "options": ["عبدالمطلب", "عبداللہ", "ابوطالب", "ابو لہب"],
    "answer": "عبداللہ"
  },
  {
    "question": "حضرت محمد ﷺ کی والدہ کا نام کیا تھا؟",
    "options": ["خدیجہ", "آمنہ", "حلیمہ", "صفیہ"],
    "answer": "آمنہ"
  },
  {
    "question": "حضرت محمد ﷺ کو دودھ پلانے والی خاتون کا نام کیا تھا؟",
    "options": ["آمنہ", "خدیجہ", "حلیمہ سعدیہ", "ام ایمن"],
    "answer": "حلیمہ سعدیہ"
  },
  {
    "question": "حضرت محمد ﷺ کی شادی کس خاتون سے سب سے پہلے ہوئی؟",
    "options": ["خدیجہ رضی اللہ عنہا", "عائشہ رضی اللہ عنہا", "صفیہ رضی اللہ عنہا", "ام سلمہ رضی اللہ عنہا"],
    "answer": "خدیجہ رضی اللہ عنہا"
  },
  {
    "question": "حضرت خدیجہ رضی اللہ عنہا نے آپ ﷺ سے شادی کس عمر میں کی؟",
    "options": ["20 سال", "25 سال", "40 سال", "35 سال"],
    "answer": "40 سال"
  },
  {
    "question": "آپ ﷺ کو پہلی وحی کہاں نازل ہوئی؟",
    "options": ["بیت المقدس", "غارِ ثور", "مدینہ","غارِ حرا" ],
    "answer": "غارِ حرا"
  },
  {
    "question": "پہلی وحی میں کون سی آیت نازل ہوئی؟",
    "options": ["اقْرَأْ بِاسْمِ رَبِّكَ", "الْحَمْدُ لِلَّهِ", "لَا إِلَٰهَ إِلَّا اللَّهُ", "قُلْ هُوَ اللَّهُ أَحَدٌ"],
    "answer": "اقْرَأْ بِاسْمِ رَبِّكَ"
  },
  {
    "question": "آپ ﷺ پر نبوت کب نازل ہوئی؟",
    "options": ["30 سال کی عمر میں", "35 سال کی عمر میں", "40 سال کی عمر میں", "45 سال کی عمر میں"],
    "answer": "40 سال کی عمر میں"
  },
  {
    "question": "حضرت محمد ﷺ کی کنیت کیا تھی؟",
    "options": ["ابو بکر","ابو القاسم" ,"ابو عبداللہ" , "ابو موسیٰ"],
    "answer": "ابو القاسم"
  },
  {
    "question": "حضرت محمد ﷺ کے کتنے بیٹے تھے؟",
    "options": ["پانچ", "دو", "چار", "تین" ],
    "answer": "تین"
  },
  {
    "question": "حضرت محمد ﷺ کے سب سے چھوٹے بیٹے کا نام کیا تھا؟",
    "options": ["عبداللہ", "قاسم", "ابراہیم", "یحییٰ"],
    "answer": "ابراہیم"
  },
  {
    "question": "حضرت محمد ﷺ کا پہلا معجزہ کیا تھا؟",
    "options": ["چاند کا دو ٹکڑے ہونا", "مکہ سے مدینہ ہجرت", "پانی کا چشمہ نکلنا", "قرآن کی وحی"],
    "answer": "چاند کا دو ٹکڑے ہونا"
  },
  {
    "question": "حضرت محمد ﷺ نے کتنی شادیاں کیں؟",
    "options": ["تین", "چار", "گیارہ", "تیرہ"],
    "answer": "گیارہ"
  },
  {
    "question": "حضرت عائشہ رضی اللہ عنہا کا لقب کیا تھا؟",
    "options": ["صدیقہ", "طیبہ", "امینہ", "زینب"],
    "answer": "صدیقہ"
  },
  {
    "question": "آپ ﷺ نے ہجرت کب کی؟",
    "options": ["10 نبوی", "13 نبوی", "1 ہجری", "5 ہجری"],
    "answer": "13 نبوی"
  },
  {
    "question": "مدینہ پہنچنے کے بعد پہلا کام کیا کیا؟",
    "options": ["مسجد بنائی", "بازار بنایا", "جنگ کی", "بیعت لی"],
    "answer": "مسجد بنائی"
  },
  {
    "question": "پہلا اسلامی معرکہ کون سا تھا؟",
    "options": ["احد", "خندق", "بدر", "حنین"],
    "answer": "بدر"
  },
  {
    "question": "غزوہ بدر کب پیش آیا؟",
    "options": ["2 ہجری", "3 ہجری", "1 ہجری", "5 ہجری"],
    "answer": "2 ہجری"
  },
  {
    "question": "غزوہ احد میں کون شہید ہوئے؟",
    "options": ["بلال", "عباس", "ابو طالب","حمزہ" ],
    "answer": "حمزہ"
  },
  {
    "question": "صلح حدیبیہ کب ہوئی؟",
    "options": ["8 ہجری", "7 ہجری","6 ہجری" , "9 ہجری"],
    "answer": "6 ہجری"
  },
  {
    "question": "فتح مکہ کب ہوئی؟",
    "options": ["7 ہجری", "8 ہجری", "9 ہجری", "10 ہجری"],
    "answer": "8 ہجری"
  },
  {
    "question": "حضرت محمد ﷺ کا خط کس شہنشاہ کو بھیجا گیا؟",
    "options": ["ہراکلیس", "فرعون", "نمرود", "کسریٰ"],
    "answer": "ہراکلیس"
  },
  {
    "question": "آپ ﷺ کا خط کس نے پہنچایا؟",
    "options": ["حضرت علی", "حضرت عمر", "حضرت دحیہ کلبی", "حضرت خالد"],
    "answer": "حضرت دحیہ کلبی"
  },
  {
    "question": "آپ ﷺ کا حجۃ الوداع کب ہوا؟",
    "options": ["8 ہجری", "9 ہجری", "10 ہجری", "11 ہجری"],
    "answer": "10 ہجری"
  },
  {
    "question": "حجۃ الوداع میں آپ ﷺ نے کتنے خطبے دیے؟",
    "options": ["1", "2", "3", "4"],
    "answer": "1"
  },
  {
    "question": "حجۃ الوداع کا مشہور جملہ کیا تھا؟",
    "options": ["آج دین مکمل ہوا", "اللہ اکبر", "اسلام غالب آ گیا", "سبحان اللہ"],
    "answer": "آج دین مکمل ہوا"
  },
  {
    "question": "آپ ﷺ کی وفات کب ہوئی؟",
    "options": ["10 ہجری", "11 ہجری", "12 ہجری", "9 ہجری"],
    "answer": "11 ہجری"
  },
  {
    "question": "آپ ﷺ کی عمر کتنی تھی؟",
    "options": ["60 سال", "61 سال", "63 سال", "65 سال"],
    "answer": "63 سال"
  },
  {
    "question": "آپ ﷺ کہاں دفن ہوئے؟",
    "options": ["مکہ", "طائف", "مدینہ", "بدر"],
    "answer": "مدینہ"
  },
  {
    "question": "آپ ﷺ نے کس قبیلے میں آنکھ کھولی؟",
    "options": ["قریش", "بنو ہاشم", "بنو امیہ", "بنو خزاعہ"],
    "answer": "بنو ہاشم"
  },
  {
    "question": "حضرت فاطمہ رضی اللہ عنہا کے شوہر کون تھے؟",
    "options": ["حضرت عمر", "حضرت علی", "حضرت عثمان", "حضرت بلال"],
    "answer": "حضرت علی"
  },
  {
    "question": "آپ ﷺ کی رضاعی بہن کا نام؟",
    "options": ["شفاء", "حلیمہ", "شیماء", "ام ایمن"],
    "answer": "شیماء"
  },
  {
    "question": "فتح مکہ کے وقت کتنے صحابہ ساتھ تھے؟",
    "options": ["1 ہزار", "5 ہزار", "3 ہزار","10 ہزار" ],
    "answer": "10 ہزار"
  },
  {
    "question": "مسجد نبوی کس نے بنائی؟",
    "options": ["حضرت عمر", "حضرت علی", "آپ ﷺ", "حضرت عثمان"],
    "answer": "آپ ﷺ"
  },
  {
    "question": "قرآن کتنے سال میں مکمل ہوا؟",
    "options": ["10 سال", "23 سال", "25 سال", "30 سال"],
    "answer": "23 سال"
  },
  {
    "question": "سب سے پہلے ایمان لانے والی خاتون؟",
    "options": ["عائشہ", "آمنہ", "خدیجہ", "صفیہ"],
    "answer": "خدیجہ"
  },
  {
    "question": "سب سے پہلے ایمان لانے والے مرد؟",
    "options": ["ابوبکر", "علی", "عثمان", "عمر"],
    "answer": "علی"
  },
  {
    "question": "سب سے پہلے ایمان لانے والے غلام؟",
    "options": ["بلال", "زید", "ام ایمن", "خباب"],
    "answer": "زید"
  }

]
}